app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."activated" = $1 LIMIT $2 OFFSET $3  [["activated", true], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = $1  [["activated", true]]
---
  def index
    @users = User.where(activated: true).paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save